MyrddinoptRoodt/LaserTag_esp8266/src/main.cpp
#include <Arduino.h>   //This libary adds some specific arduino functions


#include <IRremoteESP8266.h> //This import is the main libary to controll the IR led and receiver.
#include <IRsend.h>     //This import manages a specific part of the main IR libary
#include <IRrecv.h>     //This import manages a specific part of the main IR libary
#include <IRac.h>       //This import manages a specific part of the main IR libary
#include <IRtext.h>     //This import manages a specific part of the main IR libary
#include <IRutils.h>    //This import manages a specific part of the main IR libary


#include <assert.h> //This import contains a macro for debugging purpusses (used in the void setup to confirm the correct launch of the IR libary (sanity check))


#include <FastLED.h> //This libary manages the RGBLED's we used (replacing this libary might be a good idea)


#include <Wire.h> //this import, contains the I2c libary
#include "SSD1306Wire.h" //this manages the I2c connection  to the screen
#include "OLEDDisplayUi.h" //this imnport includes the 'driver' for the oled screen


#include <ESP8266WiFi.h> //this import includes the wifi libary: only the 2.4ghz band can be used!


#include <PubSubClient.h> //this import contains among other things the mqtt protocol

#define ledPin     2 //D4 The pin that Controlls the RGB LED's

#define CHIPSET     WS2811 //type of Individualy addressable LED's we use
#define NUM_LEDS    2 // currently we use 2 RGB LED's

#define idd '2'               //Here we define the ID of the 'gun', this shouild be set the same as the number of the 'gun' 
String idstring = "000010";   //Here we fill in the translated binary string of the ID (1=000001, 2=000010, 3=000011,...)
const char ID_TOP = '2';

String CFFA = "0001";         //These strings are predifined binary strings for the teams.
String CGREEN = "0010";       //The strings are here to change the teams, and to compare against incomming messages.
String CBLUE = "0011";        // The C in the beginnen means that these strings are for when the guns are connected to the server.
String CRED = "0100";
String CWHITE = "0101";

String  Cown = "0001";        //this is the pre-set "own team", this can be changed in the code (not recomended) and can also be changed by using the server.

int totalbullets = 0;         //this is a counter that keeps track of all bullets shot.


boolean timeout = false;      //this is a boolean state, by default this is false, when connection with the server fails 5x, the state is changed to 'true'. it is used to prevent the gun to get stuk in a reconnect loop.

WiFiClient espClient;         //libary to use wifi
PubSubClient client(espClient); //libary to use mqtt
boolean connected = false;    // avariable to keep track if the gun is connected to the mqtt server, is mainly used to update the status on the screen and to  switch to different parts of the code.

const uint32_t kBaudRate = 115200; //bitrate 115200 is fairly standard in these type of projects.

const uint16_t kCaptureBufferSize = 1024; //standard settings of the IRremoteESP8266 libary 
const uint8_t kTimeout = 50;  
const uint16_t kMinUnknownSize = 12;
const uint8_t kTolerancePercentage = kTolerance;  // kTolerance is normally 25%

const uint16_t kIrLed = 15;  // ESP8266 GPIO pin to use. Recommended: 4 (D2) // using 15 (D8) // this defines the pin used to send the IR signals
const uint16_t kRecvPin = 14; // pin to receive ir data (D5) // Defines The pin used to receive data
String ownTeam = "FFA";  //Defines the basic configurgiration
SSD1306Wire display(0x3c, SDA, SCL); //configures the display (address and i²c) (the SDA = D2,  SCL = D1)
OLEDDisplayUi ui     ( &display );   
CRGB leds[NUM_LEDS];
IRrecv irrecv(kRecvPin, kCaptureBufferSize, kTimeout, true);
decode_results results;  // Somewhere to store the results

IRsend irsend(kIrLed);  // Set the GPIO to be used to sending the message.

// Example of data captured by IRrecvDumpV2.ino
uint16_t MawData[] = { 1646 , 422 , 393, 393, 393, 393, 393, 393, 393, 786, 393, 786, 393, 786, 393, 786, 393, 1  , 2   ,3    ,4    ,5    ,6    ,7    ,8    ,9,10,11,5600}; //this is a "parody" of rawwData, It fuffils a simelair function, it sets the lenght and structure of the data neccesairy to send.
uint16_t rawData[] = { 1646 , 422 , 393, 393, 393, 393, 393, 393, 393, 786, 393, 786, 393, 786, 393, 786, 393, 1  , 2   ,3    ,4    ,5    ,6    ,7    ,8    ,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24, 5600}; //This sets the lenght and structure of the data neccesairy to send.
//uint16_t rawData[] =   { 1646 , 422 , 393, 393, 393, 393, 393, 393, 393, 786, 393, 786, 393, 786, 393, 786, 393, 393, 393 ,393  ,393  ,393  ,393  ,393  ,786  ,393, 393 ,393  ,393  ,393  ,393  ,393  ,786  ,393, 393 ,393  ,393  ,393  ,786 ,786  ,393  , 5600};

// binary codes of the 'legacy guns', "FFAGUN" is NOT legacy. These guns can be used without a server. For improved readability this part can be put in an include document. 
String BlueGunx1    = "00000001 00000001 00000110"; 
String BlueGunx2    = "00000001 00000010 00000111";
String BlueGunx3    = "00000001 00000011 00001000";
String RedGunx1     = "00000010 00000001 00000111";
String RedGunx2     = "00000010 00000010 00001000";
String RedGunx3     = "00000010 00000011 00001001";
String GreenGunx1   = "00000011 00000001 00001000";
String GreenGunx2   = "00000011 00000010 00001001";
String GreenGunx3   = "00000011 00000011 00001011";
String WhiteGunx1   = "00000100 00000001 00001001";
String WhiteGunx2   = "00000100 00000010 00001011";
String WhiteGunx3   = "00000100 00000011 00001100";
String FFAGUN       = "00000101 00000001 00001100";

//codes for the teams. Notice: these are the "legacy" codes, these will not be used when using a server.
String Blue   =   "001";
String Red    =   "010";
String Green  =   "011";
String White  =   "100";
String FFA    =   "101";
String eigenteam = "101";

// ammo amounts gun epending on gun type. This is also only for "offline games" with optionally also the legacy guns
int bullet1x = 6;
int bullet2x = 3;
int bullet3x = 1;

